In [1]:
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [7]:
dataset = pd.read_excel('C:/Users/dasar.SELVAMDG/Desktop/p/Data_Preprocessing/dataset/Employee_Data.xls')

In [4]:
os.getcwd()

'C:\\Users\\dasar.SELVAMDG\\Desktop\\p\\Data_Preprocessing'

In [4]:
dataset.head()

,Employee Id,First Name,Last Name,Department,Age,Experience,Salary
0,1,Joy,Bass,Sales and Marketing,28.0,3.0,32889
1,2,Sheila,Garza,Sales and Marketing,22.0,1.0,15944
2,3,John,Bryant,Customer Relations,22.0,1.0,40343
3,4,Christian,Farley,Customer Relations,22.0,1.0,19018
4,5,Colorado,Bowen,Accounting,27.0,0.0,24795